lagrangian/sprayFoam/gasSprayPenetration/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

xMin    0;
xMax    108;
yMin    0;
yMax    108;
zMin    0;
zMax    108;
nx      27; // Delta x_max = 4 mm, see README.md
ny      27;
nz      27;

vertices
(
    ( $xMin $yMin $zMin )
    ( $xMax $yMin $zMin )
    ( $xMax $yMax $zMin )
    ( $xMin $yMax $zMin )
    ( $xMin $yMin $zMax )
    ( $xMax $yMin $zMax )
    ( $xMax $yMax $zMax )
    ( $xMin $yMax $zMax )
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
