lagrangian/sprayFoam/gasSprayPenetration/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;

    grad(U)         cellMDLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    div(phi,U)      Gauss linearUpwind grad(U);

    turbulence      Gauss limitedLinear 1;
    energy          Gauss limitedLinear 1;
    lagrangian      Gauss limitedLinear 1;
    pressure        $energy;

    div(phi,k)      $turbulence;
    div(phi,epsilon) $turbulence;

    div(phi,h)      $energy;
    div(phi,e)      $energy;
    div(phi,K)      $energy;
    
    div(phid,p)     $pressure;

    div(phi,Yi)     $lagrangian;
    div(phi,Yi_h)   $lagrangian;

    div(((rho*nuEff)*dev2(T(grad(U)))))     Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}

// ************************************************************************* //
