lagrangian/sprayFoam/gasSprayPenetration/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-05;
        relTol          0.1;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-05;
        relTol          0;
    }

    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       0;
        relTol          0.1;
    }

    pFinal
    {
        $p;
        tolerance       1e-06;
        relTol          0;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          0.1;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        tolerance       1e-06;
        relTol          0;
    }

    "(Yi|N2)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }

    h
    {
        $Yi;
        relTol          0.1;
    }

    hFinal
    {
        $Yi;
    }
}

PIMPLE
{
    nOuterCorrectors    1;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    momentumPredictor   yes;
    transonic           no;
}

relaxationFactors
{
    equations
    {
        ".*Final"       1;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
